---
kind: property
id: P:Autodesk.Revit.DB.PlanTopologySet.Size
source: html/1fe8f8ac-5c66-91b5-d30d-11d2c4767dd5.htm
---
# Autodesk.Revit.DB.PlanTopologySet.Size Property

Returns the number of objects that are in the set.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```